# Third-party taps
tap "jundot/omlx", "https://github.com/jundot/omlx"

# CLI tools
brew "stow"
brew "ripgrep"
brew "fd"
brew "gh"
brew "jq"
brew "ffmpeg"
brew "node"
brew "pnpm"
brew "go"
brew "webp"
brew "hf"
brew "rclone"

# iOS/macOS dev
brew "xcbeautify"

# Android dev
cask "android-platform-tools"

# Native IDEs
cask "android-studio"

# AI
brew "jundot/omlx/omlx"
brew "opencode"
cask "opencode-desktop"
cask "codex"

# Browser & security
cask "1password"
cask "1password-cli"

# Messaging
cask "whatsapp"
cask "signal"
cask "discord"

# Entertainment
cask "steam"
