tap "jundot/omlx", "https://github.com/jundot/omlx"

# CLI tools
brew "stow"
brew "starship"
brew "ripgrep"
brew "fd"
brew "gh"
brew "jq"
brew "ffmpeg"
brew "node"
brew "pnpm"
brew "go"
brew "mas"
brew "aria2"
brew "tokei"
brew "webp"
brew "jundot/omlx/omlx"

# iOS/macOS dev
brew "xcbeautify"

# Android dev
cask "android-platform-tools"

# Native IDEs
cask "android-studio"

# AI
cask "claude"
cask "claude-code@latest"
cask "codex-app"
cask "codex"

# Browser & security
cask "brave-browser"
cask "1password"
cask "1password-cli"

# Messaging
cask "whatsapp"
cask "telegram"
cask "signal"
cask "discord"

# Entertainment
cask "steam"
