tap "stablyai/orca"
tap "emin93/tap"

# CLI tools
brew "stow"
brew "ripgrep"
brew "fd"
brew "fzf"
brew "gh"
brew "jq"
brew "ffmpeg"
brew "node"
brew "pnpm"
brew "go"
brew "rustup"
brew "uv"
brew "cmake"
brew "webp"
brew "hf"
brew "rclone"
brew "llama.cpp"

# Cloud
cask "gcloud-cli"

# iOS/macOS dev
brew "xcbeautify"

# Android dev
cask "android-platform-tools"
cask "android-ndk"

# Native IDEs
cask "android-studio"

# AI
cask "codex"
cask "claude-code@latest"
cask "stablyai/orca/orca"
cask "emin93/tap/dakodeon"

# Browser & security
cask "1password"
cask "1password-cli"

# Messaging
cask "whatsapp"
cask "signal"
cask "discord"

# Entertainment
cask "steam"
